docs(WebServer): use mermaid to replace ASCII image
